grevaillot/svd_tools/headers/STM32H743x/sdmmc2.h
/** @defgroup sdmmc2_clkcr CLKCR The SDMMC_CLKCR register controls the SDMMC_CK output clock, the SDMMC_RX_CLK receive clock, and the bus width.
@{*/


#define SDMMC2_CLKCR_SELCLKRX_SHIFT		20
#define SDMMC2_CLKCR_SELCLKRX_MASK		0x03
/** @defgroup sdmmc2_clkcr_selclkrx SELCLKRX Receive clock selection. These bits can only be written when the CPSM and DPSM are not active (CPSMACT = 0 and DPSMACT = 0)
@{*/
/**@}*/

/** SDMMC2_CLKCR_BUSSPEED Bus speed mode selection between DS, HS, SDR12, SDR25 and SDR50, DDR50, SDR104. This bit can only be written when the CPSM and DPSM are not active (CPSMACT = 0 and DPSMACT = 0) **/
#define SDMMC2_CLKCR_BUSSPEED		(1 << 19)
/** SDMMC2_CLKCR_DDR Data rate signaling selection This bit can only be written when the CPSM and DPSM are not active (CPSMACT = 0 and DPSMACT = 0) DDR rate shall only be selected with 4-bit or 8-bit wide bus mode. (WIDBUS &gt; 00). DDR = 1 has no effect when WIDBUS = 00 (1-bit wide bus). DDR rate shall only be selected with clock division &gt;1. (CLKDIV &gt; 0) **/
#define SDMMC2_CLKCR_DDR		(1 << 18)
/** SDMMC2_CLKCR_HWFC_EN Hardware flow control enable This bit can only be written when the CPSM and DPSM are not active (CPSMACT = 0 and DPSMACT = 0) When Hardware flow control is enabled, the meaning of the TXFIFOE and RXFIFOF flags change, please see SDMMC status register definition in Section56.8.11. **/
#define SDMMC2_CLKCR_HWFC_EN		(1 << 17)
/** SDMMC2_CLKCR_NEGEDGE SDMMC_CK dephasing selection bit for data and Command. This bit can only be written when the CPSM and DPSM are not active (CPSMACT = 0 and DPSMACT = 0). When clock division = 1 (CLKDIV = 0), this bit has no effect. Data and Command change on SDMMC_CK falling edge. When clock division &gt;1 (CLKDIV &gt; 0) &amp; DDR = 0: - SDMMC_CK edge occurs on SDMMCCLK rising edge. When clock division >1 (CLKDIV > 0) & DDR = 1: - Data changed on the SDMMCCLK falling edge succeeding a SDMMC_CK edge. - SDMMC_CK edge occurs on SDMMCCLK rising edge. - Data changed on the SDMMC_CK falling edge succeeding a SDMMC_CK edge. - SDMMC_CK edge occurs on SDMMCCLK rising edge. **/
#define SDMMC2_CLKCR_NEGEDGE		(1 << 16)

#define SDMMC2_CLKCR_WIDBUS_SHIFT		14
#define SDMMC2_CLKCR_WIDBUS_MASK		0x03
/** @defgroup sdmmc2_clkcr_widbus WIDBUS Wide bus mode enable bit This bit can only be written when the CPSM and DPSM are not active (CPSMACT = 0 and DPSMACT = 0)
@{*/
/**@}*/

/** SDMMC2_CLKCR_PWRSAV Power saving configuration bit This bit can only be written when the CPSM and DPSM are not active (CPSMACT = 0 and DPSMACT = 0) For power saving, the SDMMC_CK clock output can be disabled when the bus is idle by setting PWRSAV: **/
#define SDMMC2_CLKCR_PWRSAV		(1 << 12)

#define SDMMC2_CLKCR_CLKDIV_SHIFT		0
#define SDMMC2_CLKCR_CLKDIV_MASK		0x3ff
/** @defgroup sdmmc2_clkcr_clkdiv CLKDIV Clock divide factor This bit can only be written when the CPSM and DPSM are not active (CPSMACT = 0 and DPSMACT = 0). This field defines the divide factor between the input clock (SDMMCCLK) and the output clock (SDMMC_CK): SDMMC_CK frequency = SDMMCCLK / [2 * CLKDIV]. 0xx: etc.. xxx: etc..
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_argr ARGR The SDMMC_ARGR register contains a 32-bit command argument, which is sent to a card as part of a command message.
@{*/


#define SDMMC2_ARGR_CMDARG_SHIFT		0
#define SDMMC2_ARGR_CMDARG_MASK		0xffffffff
/** @defgroup sdmmc2_argr_cmdarg CMDARG Command argument. These bits can only be written by firmware when CPSM is disabled (CPSMEN = 0). Command argument sent to a card as part of a command message. If a command contains an argument, it must be loaded into this register before writing a command to the command register.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_cmdr CMDR The SDMMC_CMDR register contains the command index and command type bits. The command index is sent to a card as part of a command message. The command type bits control the command path state machine (CPSM).
@{*/

/** SDMMC2_CMDR_CMDSUSPEND The CPSM treats the command as a Suspend or Resume command and signals interrupt period start/end. This bit can only be written by firmware when CPSM is disabled (CPSMEN = 0). CMDSUSPEND = 1 and CMDTRANS = 0 Suspend command, start interrupt period when response bit BS=0. CMDSUSPEND = 1 and CMDTRANS = 1 Resume command with data, end interrupt period when response bit DF=1. **/
#define SDMMC2_CMDR_CMDSUSPEND		(1 << 16)
/** SDMMC2_CMDR_BOOTEN Enable boot mode procedure. **/
#define SDMMC2_CMDR_BOOTEN		(1 << 15)
/** SDMMC2_CMDR_BOOTMODE Select the boot mode procedure to be used. This bit can only be written by firmware when CPSM is disabled (CPSMEN = 0) **/
#define SDMMC2_CMDR_BOOTMODE		(1 << 14)
/** SDMMC2_CMDR_DTHOLD Hold new data block transmission and reception in the DPSM. If this bit is set, the DPSM will not move from the Wait_S state to the Send state or from the Wait_R state to the Receive state. **/
#define SDMMC2_CMDR_DTHOLD		(1 << 13)
/** SDMMC2_CMDR_CPSMEN Command path state machine (CPSM) Enable bit This bit is written 1 by firmware, and cleared by hardware when the CPSM enters the Idle state. If this bit is set, the CPSM is enabled. When DTEN = 1, no command will be transfered nor boot procedure will be started. CPSMEN is cleared to 0. **/
#define SDMMC2_CMDR_CPSMEN		(1 << 12)
/** SDMMC2_CMDR_WAITPEND CPSM Waits for end of data transfer (CmdPend internal signal) from DPSM. This bit when set, the CPSM waits for the end of data transfer trigger before it starts sending a command. WAITPEND is only taken into account when DTMODE = MMC stream data transfer, WIDBUS = 1-bit wide bus mode, DPSMACT = 1 and DTDIR = from host to card. **/
#define SDMMC2_CMDR_WAITPEND		(1 << 11)
/** SDMMC2_CMDR_WAITINT CPSM waits for interrupt request. If this bit is set, the CPSM disables command timeout and waits for an card interrupt request (Response). If this bit is cleared in the CPSM Wait state, will cause the abort of the interrupt mode. **/
#define SDMMC2_CMDR_WAITINT		(1 << 10)

#define SDMMC2_CMDR_WAITRESP_SHIFT		8
#define SDMMC2_CMDR_WAITRESP_MASK		0x03
/** @defgroup sdmmc2_cmdr_waitresp WAITRESP Wait for response bits. This bit can only be written by firmware when CPSM is disabled (CPSMEN = 0). They are used to configure whether the CPSM is to wait for a response, and if yes, which kind of response.
@{*/
/**@}*/

